[
  {
    "id": 1,
    "cover": "https://i.ibb.co/fQWMnJM/1.png",
    "title": "Introduction to C Programming",
    "details": "This course provides a comprehensive introduction to the fundamentals of C Programming. You will learn the basics of C syntax, data types, control structures, and more. Suitable for beginners.",
    "price": 15000,
    "credit": 1
  },
  {
    "id": 2,
    "cover": "https://i.ibb.co/kDW91Sv/2.png",
    "title": "Introduction to Algorithms",
    "details": "Master the world of algorithms with our introductory course. Explore various algorithmic techniques and problem-solving strategies. Prior programming experience is recommended.",
    "price": 25000,
    "credit": 2
  },
  {
    "id": 3,
    "cover": "https://i.ibb.co/nzvFTDZ/3.png",
    "title": "Introduction to C++ for DSA",
    "details": "Combine C++ programming with Data Structures and Algorithms to build a strong foundation in problem-solving. This course is suitable for those with prior programming knowledge.",
    "price": 10000,
    "credit": 10
  },
  {
    "id": 4,
    "cover": "https://i.ibb.co/gDXhx95/4.png",
    "title": "Basic Data Structures",
    "details": "Explore essential data structures such as arrays, linked lists, and trees, and their real-world applications. Prior programming experience is recommended.",
    "price": 35000,
    "credit": 5
  },
  {
    "id": 5,
    "cover": "https://i.ibb.co/QYZRQdq/5.png",
    "title": "Introduction to CQP Python",
    "details": "An introduction to Python programming for Computational and Quantum Programming. Dive into Python's applications in quantum computing and simulations.",
    "price": 19000,
    "credit": 5
  },
  {
    "id": 6,
    "cover": "https://i.ibb.co/nDrTsnv/6.png",
    "title": "Software Engineering",
    "details": "Learn the principles and practices of software engineering, including software development methodologies, project management, and quality assurance.",
    "price": 10000,
    "credit": 2
  },
  {
      "id": 7,
      "cover": "https://i.ibb.co/3B2VbRy/7.png",
      "title": "AWS, Cloud Computing",
      "details": "Master Amazon Web Services (AWS) and the world of Cloud Computing. Explore cloud infrastructure, services, and deployment strategies.",
      "price": 35000,
      "credit": 5
  },
  {
      "id": 8,
      "cover": "https://i.ibb.co/tpYxSKX/8.png",
      "title": "Database (MySQL)",
      "details": "Gain hands-on experience in MySQL Database Management. Learn database design, SQL queries, and data manipulation.",
      "price": 19000,
      "credit": 5
  },
  {
      "id": 9,
      "cover": "https://i.ibb.co/ngy9tCW/9.png",
      "title": "Problem-Solving Part",
      "details": "Develop your problem-solving skills interactively. Solve coding challenges and logical puzzles to enhance your analytical thinking.",
      "price": 23000,
      "credit": 2
  }
]
